#Generated by Fabric Compiler ( version 2022.2-SP6.4 <build 146967> ) at Wed Jul 22 23:25:20 2026

add_design "P:/AI_LLM_FPGA/pangu_ai_accel/source/uart_rx.v"
add_design "P:/AI_LLM_FPGA/pangu_ai_accel/source/uart_tx.v"
add_design "P:/AI_LLM_FPGA/pangu_ai_accel/source/int8_dot16.v"
add_design "P:/AI_LLM_FPGA/pangu_ai_accel/source/top.v"
add_constraint "source/top.fdc"
set_arch -family Logos2 -device PG2L50H -speedgrade -6 -package FBG484
compile -top_module {top} -top_module top
synthesize -ads -selected_syn_tool_opt 2 
add_design "P:/AI_LLM_FPGA/pangu_ai_accel/source/uart_rx.v"
add_design "P:/AI_LLM_FPGA/pangu_ai_accel/source/uart_tx.v"
add_design "P:/AI_LLM_FPGA/pangu_ai_accel/source/int8_dot16.v"
add_design "P:/AI_LLM_FPGA/pangu_ai_accel/source/top.v"
add_constraint "source/top.fdc"
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -top_module {top} -top_module top
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream 
