#Generated by Fabric Compiler ( version 2022.2-SP6.4 <build 146967> ) at Thu Jul 23 13:27:57 2026

set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile 
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr -optimize_multi_corner_timing -fix_hold_violation 
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile 
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -top_module test_ddr
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -top_module test_ddr
synthesize -ads -selected_syn_tool_opt 2 
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -top_module test_ddr
synthesize -ads -selected_syn_tool_opt 2 
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -top_module test_ddr
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -top_module test_ddr
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -top_module test_ddr
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr -optimize_multi_corner_timing -fix_hold_violation 
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -top_module test_ddr
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -top_module test_ddr
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr -optimize_multi_corner_timing -fix_hold_violation 
report_timing 
report_power 
gen_netlist 
gen_bit_stream 
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -top_module test_ddr
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -top_module test_ddr
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr -optimize_multi_corner_timing -fix_hold_violation 
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -top_module test_ddr
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -top_module test_ddr
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -top_module test_ddr
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr -optimize_multi_corner_timing -fix_hold_violation 
report_timing 
report_power 
gen_netlist 
gen_bit_stream 
